<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"2426d034018fd700d8153447e4b84eab13044e8086fba392e76e1470b1c2f7a9","plan_job_ref":"Job Terraform Plan #17 at https://github.com/getsentry/secure-cloud-functions-template/actions/runs/21889507061","plan_out_hash":"b9f81e9c35c58f564966d8d3d3c49ea81b4acde61ce323d26716ffe659f114e6","plan_hash":"6058d2f0c46063cbe78f85c7bbce19cc4d014563864241826c34e2112a4ca6a2","plan_text_format":"diff","version":"1.48.0","closed":true} -->
Terraform plan in __.__
<details>
<summary>Plan: 1 to add, 1 to change, 1 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.functions.module.cloud_function_gen2["get-gh-app-token"].google_cloudfunctions2_function.function will be updated in-place
!~  resource "google_cloudfunctions2_function" "function" {
        id               = "projects/jeffreyhung-test/locations/us-west1/functions/get-gh-app-token"
        name             = "get-gh-app-token"
#        (11 unchanged attributes hidden)

!~      build_config {
#            (7 unchanged attributes hidden)

!~          source {
!~              storage_source {
!~                  object     = "src-f2ec688d46b8e4d3376b38e05871be13.zip" -> "src-0b1adba46fd182540b0929c009c93f51.zip"
#                    (2 unchanged attributes hidden)
                }
            }

#            (1 unchanged block hidden)
        }

#        (1 unchanged block hidden)
    }

  # module.functions.module.cloud_function_gen2["get-gh-app-token"].google_storage_bucket_object.zip must be replaced
-/+ resource "google_storage_bucket_object" "zip" {
+       content             = (sensitive value)
!~      crc32c              = "sTX9vw==" -> (known after apply)
!~      detect_md5hash      = "8uxojUa45NM3azjgWHG+Ew==" -> "different hash"
-       event_based_hold    = false -> null
!~      generation          = 1769813521296177 -> (known after apply)
!~      id                  = "********************************************************************************" -> (known after apply)
+       kms_key_name        = (known after apply)
!~      md5hash             = "8uxojUa45NM3azjgWHG+Ew==" -> (known after apply)
!~      media_link          = "https://storage.googleapis.com/download/storage/v1/b/jeffreyhung-test-cloud-function-staging/o/src-f2ec688d46b8e4d3376b38e05871be13.zip?generation=1769813521296177&alt=media" -> (known after apply)
!~      name                = "src-f2ec688d46b8e4d3376b38e05871be13.zip" -> "src-0b1adba46fd182540b0929c009c93f51.zip" # forces replacement
!~      output_name         = "src-f2ec688d46b8e4d3376b38e05871be13.zip" -> (known after apply)
!~      self_link           = "https://www.googleapis.com/storage/v1/b/jeffreyhung-test-cloud-function-staging/o/src-f2ec688d46b8e4d3376b38e05871be13.zip" -> (known after apply)
!~      storage_class       = "STANDARD" -> (known after apply)
-       temporary_hold      = false -> null
#        (8 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.
```
</details>

:white_check_mark: Plan applied in [Terraform Apply #40](https://github.com/getsentry/secure-cloud-functions-template/actions/runs/22962501883)